/*
*********************************************************************************************************
*
*	程序名称: 定时器驱动模块
*	文件名称: bsp_timer.h
*	版    本: v1.0.0
*   编    写: 莫利奖
*   日    期: 2021年4月9日
*
*	Copyright (C), 2021-2031, 深圳市风巽云科技有限公司 https://fxymcu.taobao.com
*
*********************************************************************************************************
*/

#ifndef __BSP_TIMER_H
#define __BSP_TIMER_H

/* 供外部调用 */
extern uint8_t ucSys10msFlag;
void bsp_InitTMR6(void);

#endif

/********************************************* End of file **********************************************/
