/*
*********************************************************************************************************
*
*	程序名称: 系统延时模块
*	文件名称: bsp_delay.h
*	版    本: v1.0.0
*   编    写: 莫利奖
*   日    期: 2021年3月20日
*
*	Copyright (C), 2021-2031, 深圳市风巽云科技有限公司 https://fxymcu.taobao.com
*
*********************************************************************************************************
*/

#ifndef __BSP_DELAY_H
#define __BSP_DELAY_H

/* 供外部调用函数 */
void bsp_InitSysTick(void);
void bsp_DelayUs(uint32_t ulNus);
void bsp_DelayMs(uint32_t ulNms);

#endif

/********************************************* End of file **********************************************/
