/*
*********************************************************************************************************
*
*	程序名称: LED灯驱动模块
*	文件名称: bsp_led.h
*	版    本: v1.0.0
*   编    写: 莫利奖
*   日    期: 2021年4月8日
*
*	Copyright (C), 2021-2031, 深圳市风巽云科技有限公司 https://fxymcu.taobao.com
*
*********************************************************************************************************
*/

#ifndef __BSP_LED_H
#define __BSP_LED_H

/* 供外部调用函数 */
void bsp_InitLED(void);
void bsp_LED_On(void);
void bsp_LED_Off(void);
void bsp_LED_Toggle(void);

#endif

/********************************************* End of file **********************************************/
