/*
*********************************************************************************************************
*
*	程序名称: PWM驱动模块
*	文件名称: bsp_pwm.h
*	版    本: v1.0.0
*   编    写: 莫利奖
*   日    期: 2021年4月9日
*
*	Copyright (C), 2021-2031, 深圳市风巽云科技有限公司 https://fxymcu.taobao.com
*
*********************************************************************************************************
*/

#ifndef __BSP_PWM_H
#define __BSP_PWM_H

/* 供外部调用函数 */
void bsp_InitTMR3_PWM3(uint8_t ucPwmDuty);
void bsp_TMR3_PWM3_SetDuty(uint8_t ucDuty);

#endif

/********************************************* End of file **********************************************/
