/*
*********************************************************************************************************
*
*	程序名称: LED灯驱动模块
*	文件名称: bsp_led.c
*	版    本: v1.0.0
*   编    写: 莫利奖
*	说    明: 
*
*	版本记录: 
*	v1.0.0: 2021年4月8日，初版
*
*	Copyright (C), 2021-2031, 深圳市风巽云科技有限公司 https://fxymcu.taobao.com
*
*********************************************************************************************************
*/

#include "bsp.h"

/* 驱动引脚定义 */
#define LED_PORT GPIOB
#define LED_PIN GPIO_Pins_0
#define LED_GPIO_RCC RCC_AHBPERIPH_GPIOB

/*
*********************************************************************************************************
*	函 数 名: bsp_InitLED
*	功能说明: 配置LED指示灯相关的GPIO
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitLED(void)
{
    GPIO_InitType GPIO_InitStructure;

    /* 使能GPIO时钟 */
    RCC_AHBPeriphClockCmd(LED_GPIO_RCC, ENABLE);

    /* 设置电平 */
    GPIO_SetBits(LED_PORT, LED_PIN);

    /* 配置GPIO */
    GPIO_StructInit(&GPIO_InitStructure);
    GPIO_InitStructure.GPIO_Pins = LED_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OutType = GPIO_OutType_OD; /* 开漏输出 */
    GPIO_InitStructure.GPIO_MaxSpeed = GPIO_MaxSpeed_50MHz;
    GPIO_Init(LED_PORT, &GPIO_InitStructure);
}

/*
*********************************************************************************************************
*	函 数 名: bsp_LED_On
*	功能说明: 点亮LED指示灯。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_LED_On(void)
{
    LED_PORT->BRE = LED_PIN;
}

/*
*********************************************************************************************************
*	函 数 名: bsp_LED_Off
*	功能说明: 熄灭LED指示灯。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_LED_Off(void)
{
    LED_PORT->BSRE = LED_PIN;
}

/*
*********************************************************************************************************
*	函 数 名: bsp_LED_Toggle
*	功能说明: 翻转LED指示灯。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_LED_Toggle(void)
{
    LED_PORT->OPTDT ^= LED_PIN;
}

/********************************************* End of file **********************************************/
